// languages array indexes: EN=0, BY=1, RU=2;

export const languages = {
  about: ['About app', 'Пра дадатак', 'О приложении', 'Про додатак'],
  editor: ['Editor', 'Рэдактар', 'Редактор', 'Редактор'],

  signIn: ['Sign In', 'Увайсці', 'Войти', 'Увійти'],
  signUp: ['Sign Up', 'Рэгiстрацыя', 'Регистрация', 'Реєстрація'],
  register: ['Register', 'Рэгiстрацыя', 'Регистрация', 'Реєстрація'],
  goBack: ['Go Back', 'Вярнуцца назад', 'Вернуться назад', 'Повернутися назад'],
  signOut: ['Sign out', 'Выйсці', 'Выйти', 'Вийти'],
  toEditor: ['To Editor', 'Да Рэдактара', 'К Редактору', 'До Редактора'],

  pass: ['password', 'пароль', 'пароль', 'пароль'],
  confirmPass: [
    'confirm password',
    'паўтарыць пароль',
    'повторить пароль',
    'повторити пароль',
  ],

  notAccount: [
    "Don't have an account yet?",
    'Яшчэ няма уліковага запісу?',
    'Ещё нет аккаунта?',
    'Ще немає облікового запису?',
  ],
  haveAccount: [
    'Have an account?',
    'Ёсць уліковы запіс?',
    'Есть аккаунт?',
    'Є обліковий запис?',
  ],

  autorize: [
    'Please authorize to access app!',
    'Калі ласка, аўтарызуйцеся для доступу да дадатку!',
    'Пожалуйста, авторизуйтесь для доступа к приложению!',
    'Будь ласка, авторизуйтесь для доступу до додатку!',
  ],

  welcome: [
    'Welcome to our app!',
    'Сардэчна запрашаем да нашага дадатака!',
    'Добро пожаловать в наше приложение!',
    'Ласкаво просимо до нашого додатку!',
  ],

  aboutTeam: ['About the team:', 'Аб камандзе:', 'О команде:', 'Про команду:'],

  Viktoriya: ['Viktoriya', 'Вікторыя', 'Виктория', 'Вікторія'],
  Artem: ['Artem', 'Арцём', 'Артём', 'Артем'],
  Denis: ['Denis', 'Дзянiс', 'Денис', 'Денис'],

  VikaPart: [
    `Participation in the project:\n
    - Login/Register\n
    - Auth forms\n
    - Query prettify\n
    - Unit tests\n
    `,
    `Удзел у праекце: \n
    - Уваход/Рэгістрацыя\n
    - Формы для аўтарызацыі\n
    - Фарматаванне запыту\n
    - Юніт тэсты\n
    `,
    `Участие в проекте: \n
    - Вход/Регистрация\n
    - Формы для авторизации\n
    - Форматирование запроса\n
    - Юнит тесты\n
    `,
    `Участь у проекті: \n
    - Вхід/Реєстрація\n
    - Форми для авторизації\n
    - Форматування запиту\n
    - Юніт тести\n
    `,
  ],

  ArtemPart: [
    `Participation in the project:\n
    - Query editor\n
    - Response viewer\n
    - Documentation/schema\n
    `,
    `Удзел у праекце: \n
    - Рэдактар запыту\n
    - Манітор адказу\n
    - Дакументацыя/схема\n
    `,
    `Участие в проекте: \n
    - Редактор запроса\n
    - Монитор ответа\n
    - Документация/схема\n
    `,
    `Участь у проекті: \n
    - Редактор запиту\n
    - Монітор відповіді\n
    - Документація/схема\n
    `,
  ],

  DenPart: [
    `Participation in the project:\n
    - Welcome Page\n
    - Header and Footer\n
    - Variables and Headers\n
    - Localization\n
    `,
    `Удзел у праекце: \n
    - Вітальная старонка\n
    - Хэдэр i Футэр\n
    - Зменныя і загалоўкі\n
    - Лакалізацыя\n
    `,
    `Участие в проекте: \n
    - Приветственная страница\n
    - Хедер и Футер\n
    - Переменные и заголовки\n
    - Локализация\n
    `,
    `Участь у проекті: \n
    - Вітальна сторінка\n
    - Хедер i Футер\n
    - Змінні та заголовки\n
    - Локалізація\n
    `,
  ],

  aboutApp: ['About the App:', 'Аб дадатку:', 'О приложении:', 'Про додаток:'],
};
